Autodesk.Revit.DB.JoinType
The type of join at the end of an element. The join type affects only the graphic treatment, i.e.
cleaning of the end, not the physical join behavior.

Autodesk.Revit.DB.JoinType.Extension
Extension Join

Autodesk.Revit.DB.JoinType.SquareOff
Square-off Join

Autodesk.Revit.DB.JoinType.Miter
Miter Join

Autodesk.Revit.DB.JoinType.Abut
Abut Join

Autodesk.Revit.DB.JoinType.None
No join type